{
  "alpha_pattern": {},
  "base_model_name_or_path": "TinyLlama/TinyLlama-1.1B-Chat-v1.0",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "target_modules": [
    "o_proj",
    "q_proj",
    "v_proj",
    "k_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}